##pandas

In [ ]:
pandas is a data structure 
##components
-data frames-greater than two features(columns)with any no of rows(data)
- data series-one feature(columns) with any no of rows (data)

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.15.4 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [3]:
import pandas as pd  
import numpy as np

In [21]:
##playing with data frame
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1','row2','row3','row4','row5'],columns=['column1','column2','column3','column4'] )
df

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [32]:
##converting it to excel file 
df.to_csv('dataframe.xlsx') ##go to location to check if file is created or not

In [33]:
df

  Unnamed: 0  column1  column2  column3  column4
0       row1        0        1        2        3
1       row2        4        5        6        7
2       row3        8        9       10       11
3       row4       12       13       14       15
4       row5       16       17       18       19

In [60]:
##accessing locatotions
df.loc[1]

Unnamed: 0    row2
column1          4
column2          5
column3          6
column4          7
Name: 1, dtype: object

In [41]:
df.iloc[0:3,0:2]

  Unnamed: 0  column1
0       row1        0
1       row2        4
2       row3        8

In [46]:
df.iloc[0:3,0]

0    row1
1    row2
2    row3
Name: Unnamed: 0, dtype: object

In [47]:
### convert dataframes into arrays 
df.iloc[:,1:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]], dtype=int64)

In [48]:
df.iloc[:,1:].values.shape ##.shape is used to know no of columns and rows

(5, 4)

In [49]:
##to check the null values 
df.isnull().sum()

Unnamed: 0    0
column1       0
column2       0
column3       0
column4       0
dtype: int64

In [50]:
df

  Unnamed: 0  column1  column2  column3  column4
0       row1        0        1        2        3
1       row2        4        5        6        7
2       row3        8        9       10       11
3       row4       12       13       14       15
4       row5       16       17       18       19

In [51]:
##to find the no of unique counts 
df['column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: column1, dtype: int64

In [52]:
##unique function
df['column1'].unique()

array([ 0,  4,  8, 12, 16], dtype=int64)

In [56]:
df[['column3','column4']]

   column3  column4
0        2        3
1        6        7
2       10       11
3       14       15
4       18       19

In [61]:
##inbuilt functions
df.info() ###to know the data types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      object
 1   column1     5 non-null      int64
 2   column2     5 non-null      int64
 3   column3     5 non-null      int64
 4   column4     5 non-null      int64
dtypes: int64(4), object(1)
memory usage: 328.0+ bytes

In [62]:
df.describe() ###categorial features are skipped as they are not numbers

         column1    column2    column3    column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [67]:
df[df['column3']>5] ##to display only the elements greater than 5 in colums

  Unnamed: 0  column1  column2  column3  column4
1       row2        4        5        6        7
2       row3        8        9       10       11
3       row4       12       13       14       15
4       row5       16       17       18       19

In [75]:
###creating csv (comma seperated value) file 
data=('col1,col2,col3\n''x,y,1\n''a,b,2\n''c,d,3')

In [76]:
data

'col1,col2,col3\nx,y,1\na,b,2\nc,d,3'

In [77]:
type(data)

str

In [5]:
from io import StringIO,BytesIO

StringIO()

In [89]:
pd.read_csv(StringIO(data)) ##coverting csv file into proper data frame/data table

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [81]:
type(df)

pandas.core.frame.DataFrame

In [83]:
##to read specific columns
df=pd.read_csv(StringIO(data),usecols=['col1'])
df

  col1
0    x
1    a
2    c

In [90]:
#to save it as csv file in location
df.to_csv('testt.csv')

df=pd.read_csv('testt.csv')

In [91]:
df

  col1
0    x
1    a
2    c

In [22]:
###To specify column data types
data=('a,b,c,d\n''1,2,3,4\n''5,6,7,8\n''9,10,11,12')
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [23]:
##object data type 
df=pd.read_csv(StringIO(data),dtype=object)
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [24]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [25]:
df['a'][1]

'5'

In [26]:
##type float
df=pd.read_csv(StringIO(data),dtype=float)
df

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [27]:
df['a']

0    1.0
1    5.0
2    9.0
Name: a, dtype: float64

In [28]:
df['a'][1]

5.0

In [29]:
###type int 
df=pd.read_csv(StringIO(data),dtype=int) 
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [30]:
df['a']

0    1
1    5
2    9
Name: a, dtype: int32

In [31]:
df['a'][1]

5

In [40]:
###specifying different columns with different data types 
df=pd.read_csv(StringIO(data),dtype={'b':int,'c':float,'a':'Int64'})

In [41]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [43]:
##Making first/0th column as index
data=('index,a,b,c\n''4,apple,bat,5.7\n''8,orange,cow,10')

In [44]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [51]:
data=('a,b,c\n''4,apple,bat,\n''8,orange,cow,')
pd.read_csv(StringIO(data)) ##takes datatype as none hence  takes 4,8 as index

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [52]:
##to remove the above issue 
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [54]:
##combining usecols and indexcols 
data=('a,b,c\n''4,apple,bat,\n''8,orange,cow,')
pd.read_csv(StringIO(data),index_col=False,usecols=['b','c'])

        b    c
0   apple  bat
1  orange  cow

In [55]:
##quoting and escape characters 
data='a,b\n"hello, \\"bob \\",nice to meet you",5'
pd.read_csv(StringIO(data),escapechar='\\')

                                a  b
0  hello, "bob ",nice to meet you  5

In [28]:
##read json (java script object notation file ) to csv
Data ='{"employee_name":"james","email":"james@gmail.com","job_profile":[{"title1":"team lead","title2":"devoloper"}]}'
df1=pd.read_json(Data)
df1

,employee_name,email,job_profile
0,james,james@gmail.com,"{'title1': 'team lead', 'title2': 'devoloper'}"

In [29]:
df=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data')

In [22]:
df.head()

,1,14.23,1.71,2.43,15.6,127,2.8,3.06,.28,2.29,5.64,1.04,3.92,1065
0,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
1,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
2,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
3,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735
4,1,14.20,1.76,2.45,15.2,112,3.27,3.39,0.34,1.97,6.75,1.05,2.85,1450

In [23]:
##convert json to csv
df.to_csv('wine.csv')

In [15]:
pd.read_csv('wine.csv')

,Unnamed: 0,1,14.23,1.71,2.43,15.6,127,2.8,3.06,.28,2.29,5.64,1.04,3.92,1065
0,0,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
1,1,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
2,2,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
3,3,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735
4,4,1,14.20,1.76,2.45,15.2,112,3.27,3.39,0.34,1.97,6.75,1.05,2.85,1450
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
172,172,3,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7.70,0.64,1.74,740
173,173,3,13.40,3.91,2.48,23.0,102,1.80,0.75,0.43,1.41,7.30,0.70,1.56,750
174,174,3,13.27,4.28,2.26,20.0,120,1.59,0.69,0.43,1.35,10.20,0.59,1.56,835
175,175,3,13.17,2.59,2.37,20.0,120,1.65,0.68,0.53,1.46,9.30,0.60,1.62,840
176,176,3,14.13,4.10,2.74,24.5,96,2.05,0.76,0.56,1.35,9.20,0.61,1.60,560

In [33]:
##convert json to different json formats 

df.to_json(orient='records')

'[{"1":1,"14.23":13.2,"1.71":1.78,"2.43":2.14,"15.6":11.2,"127":100,"2.8":2.65,"3.06":2.76,".28":0.26,"2.29":1.28,"5.64":4.38,"1.04":1.05,"3.92":3.4,"1065":1050},{"1":1,"14.23":13.16,"1.71":2.36,"2.43":2.67,"15.6":18.6,"127":101,"2.8":2.8,"3.06":3.24,".28":0.3,"2.29":2.81,"5.64":5.68,"1.04":1.03,"3.92":3.17,"1065":1185},{"1":1,"14.23":14.37,"1.71":1.95,"2.43":2.5,"15.6":16.8,"127":113,"2.8":3.85,"3.06":3.49,".28":0.24,"2.29":2.18,"5.64":7.8,"1.04":0.86,"3.92":3.45,"1065":1480},{"1":1,"14.23":13.24,"1.71":2.59,"2.43":2.87,"15.6":21.0,"127":118,"2.8":2.8,"3.06":2.69,".28":0.39,"2.29":1.82,"5.64":4.32,"1.04":1.04,"3.92":2.93,"1065":735},{"1":1,"14.23":14.2,"1.71":1.76,"2.43":2.45,"15.6":15.2,"127":112,"2.8":3.27,"3.06":3.39,".28":0.34,"2.29":1.97,"5.64":6.75,"1.04":1.05,"3.92":2.85,"1065":1450},{"1":1,"14.23":14.39,"1.71":1.87,"2.43":2.45,"15.6":14.6,"127":96,"2.8":2.5,"3.06":2.52,".28":0.3,"2.29":1.98,"5.64":5.25,"1.04":1.02,"3.92":3.58,"1065":1290},{"1":1,"14.23":14.06,"1.71":2.15,"2.43":2.61,"15.6":17.6,"127":121,"2.8":2.6,"3.06":2.51,".28":0.31,"2.29":1.25,"5.64":5.05,"1.04":1.06,"3.92":3.58,"1065":1295},{"1":1,"14.23":14.83,"1.71":1.64,"2.43":2.17,"15.6":14.0,"127":97,"2.8":2.8,"3.06":2.98,".28":0.29,"2.29":1.98,"5.64":5.2,"1.04":1.08,"3.92":2.85,"1065":1045},{"1":1,"14.23":13.86,"1.71":1.35,"2.43":2.27,"15.6":16.0,"127":98,"2.8":2.98,"3.06":3.15,".28":0.22,"2.29":1.85,"5.64":7.22,"1.04":1.01,"3.92":3.55,"1065":1045},{"1":1,"14.23":14.1,"1.71":2.16,"2.43":2.3,"15.6":18.0,"127":105,"2.8":2.95,"3.06":3.32,".28":0.22,"2.29":2.38,"5.64":5.75,"1.04":1.25,"3.92":3.17,"1065":1510},{"1":1,"14.23":14.12,"1.71":1.48,"2.43":2.32,"15.6":16.8,"127":95,"2.8":2.2,"3.06":2.43,".28":0.26,"2.29":1.57,"5.64":5.0,"1.04":1.17,"3.92":2.82,"1065":1280},{"1":1,"14.23":13.75,"1.71":1.73,"2.43":2.41,"15.6":16.0,"127":89,"2.8":2.6,"3.06":2.76,".28":0.29,"2.29":1.81,"5.64":5.6,"1.04":1.15,"3.92":2.9,"1065":1320},{"1":1,"14.23":14.75,"1.71":1.73,"2.43":2.39,"15.6":11.4,"127":91,"2.8":3.1,"3.06":3.69,".28":0.43,"2.29":2.81,"5.64":5.4,"1.04":1.25,"3.92":2.73,"1065":1150},{"1":1,"14.23":14.38,"1.71":1.87,"2.43":2.38,"15.6":12.0,"127":102,"2.8":3.3,"3.06":3.64,".28":0.29,"2.29":2.96,"5.64":7.5,"1.04":1.2,"3.92":3.0,"1065":1547},{"1":1,"14.23":13.63,"1.71":1.81,"2.43":2.7,"15.6":17.2,"127":112,"2.8":2.85,"3.06":2.91,".28":0.3,"2.29":1.46,"5.64":7.3,"1.04":1.28,"3.92":2.88,"1065":1310},{"1":1,"14.23":14.3,"1.71":1.92,"2.43":2.72,"15.6":20.0,"127":120,"2.8":2.8,"3.06":3.14,".28":0.33,"2.29":1.97,"5.64":6.2,"1.04":1.07,"3.92":2.65,"1065":1280},{"1":1,"14.23":13.83,"1.71":1.57,"2.43":2.62,"15.6":20.0,"127":115,"2.8":2.95,"3.06":3.4,".28":0.4,"2.29":1.72,"5.64":6.6,"1.04":1.13,"3.92":2.57,"1065":1130},{"1":1,"14.23":14.19,"1.71":1.59,"2.43":2.48,"15.6":16.5,"127":108,"2.8":3.3,"3.06":3.93,".28":0.32,"2.29":1.86,"5.64":8.7,"1.04":1.23,"3.92":2.82,"1065":1680},{"1":1,"14.23":13.64,"1.71":3.1,"2.43":2.56,"15.6":15.2,"127":116,"2.8":2.7,"3.06":3.03,".28":0.17,"2.29":1.66,"5.64":5.1,"1.04":0.96,"3.92":3.36,"1065":845},{"1":1,"14.23":14.06,"1.71":1.63,"2.43":2.28,"15.6":16.0,"127":126,"2.8":3.0,"3.06":3.17,".28":0.24,"2.29":2.1,"5.64":5.65,"1.04":1.09,"3.92":3.71,"1065":780},{"1":1,"14.23":12.93,"1.71":3.8,"2.43":2.65,"15.6":18.6,"127":102,"2.8":2.41,"3.06":2.41,".28":0.25,"2.29":1.98,"5.64":4.5,"1.04":1.03,"3.92":3.52,"1065":770},{"1":1,"14.23":13.71,"1.71":1.86,"2.43":2.36,"15.6":16.6,"127":101,"2.8":2.61,"3.06":2.88,".28":0.27,"2.29":1.69,"5.64":3.8,"1.04":1.11,"3.92":4.0,"1065":1035},{"1":1,"14.23":12.85,"1.71":1.6,"2.43":2.52,"15.6":17.8,"127":95,"2.8":2.48,"3.06":2.37,".28":0.26,"2.29":1.46,"5.64":3.93,"1.04":1.09,"3.92":3.63,"1065":1015},{"1":1,"14.23":13.5,"1.71":1.81,"2.43":2.61,"15.6":20.0,"127":96,"2.8":2.53,"3.06":2.61,".28":0.28,"2.29":1.66,"5.64":3.52,"1.04":1.12,"3.92":3.82,"1065":845},{"1":1,"14.23":13.05,"1.71":2.05,"2.43":3.22,"15.6":25.0,"127":124,"2.8":2.63,"3.06":2.68,".28":0.47,"2.29":1.92,"5.64":3.58,"1.04":1.13,"3.92":3.2,"1065":830},{"1":1,"14.23":13.39,"1.71":1.77,"2.43":2.62,"15.6":16.1,"127":93,"2.8":2.85,"3.06":2.94,".28":0.34,"2.29":1.45,"5.64":4.8,"1.04":0.92,"3.92":3.22,"1065":1195},{"1":1,"14.23":13.3,"1.71":1.72,"2.43":2.14,"15.6":17.0,"127":94,"2.8":2.4,"3.06":2.19,".28":0.27,"2.29":1.35,"5.64":3.95,"1.04":1.02,"3.92":2.77,"1065":1285},{"1":1,"14.23":13.87,"1.71":1.9,"2.43":2.8,"15.6":19.4,"127":107,"2.8":2.95,"3.06":2.97,".28":0.37,"2.29":1.76,"5.64":4.5,"1.04":1.25,"3.92":3.4,"1065":915},{"1":1,"14.23":14.02,"1.71":1.68,"2.43":2.21,"15.6":16.0,"127":96,"2.8":2.65,"3.06":2.33,".28":0.26,"2.29":1.98,"5.64":4.7,"1.04":1.04,"3.92":3.59,"1065":1035},{"1":1,"14.23":13.73,"1.71":1.5,"2.43":2.7,"15.6":22.5,"127":101,"2.8":3.0,"3.06":3.25,".28":0.29,"2.29":2.38,"5.64":5.7,"1.04":1.19,"3.92":2.71,"1065":1285},{"1":1,"14.23":13.58,"1.71":1.66,"2.43":2.36,"15.6":19.1,"127":106,"2.8":2.86,"3.06":3.19,".28":0.22,"2.29":1.95,"5.64":6.9,"1.04":1.09,"3.92":2.88,"1065":1515},{"1":1,"14.23":13.68,"1.71":1.83,"2.43":2.36,"15.6":17.2,"127":104,"2.8":2.42,"3.06":2.69,".28":0.42,"2.29":1.97,"5.64":3.84,"1.04":1.23,"3.92":2.87,"1065":990},{"1":1,"14.23":13.76,"1.71":1.53,"2.43":2.7,"15.6":19.5,"127":132,"2.8":2.95,"3.06":2.74,".28":0.5,"2.29":1.35,"5.64":5.4,"1.04":1.25,"3.92":3.0,"1065":1235},{"1":1,"14.23":13.51,"1.71":1.8,"2.43":2.65,"15.6":19.0,"127":110,"2.8":2.35,"3.06":2.53,".28":0.29,"2.29":1.54,"5.64":4.2,"1.04":1.1,"3.92":2.87,"1065":1095},{"1":1,"14.23":13.48,"1.71":1.81,"2.43":2.41,"15.6":20.5,"127":100,"2.8":2.7,"3.06":2.98,".28":0.26,"2.29":1.86,"5.64":5.1,"1.04":1.04,"3.92":3.47,"1065":920},{"1":1,"14.23":13.28,"1.71":1.64,"2.43":2.84,"15.6":15.5,"127":110,"2.8":2.6,"3.06":2.68,".28":0.34,"2.29":1.36,"5.64":4.6,"1.04":1.09,"3.92":2.78,"1065":880},{"1":1,"14.23":13.05,"1.71":1.65,"2.43":2.55,"15.6":18.0,"127":98,"2.8":2.45,"3.06":2.43,".28":0.29,"2.29":1.44,"5.64":4.25,"1.04":1.12,"3.92":2.51,"1065":1105},{"1":1,"14.23":13.07,"1.71":1.5,"2.43":2.1,"15.6":15.5,"127":98,"2.8":2.4,"3.06":2.64,".28":0.28,"2.29":1.37,"5.64":3.7,"1.04":1.18,"3.92":2.69,"1065":1020},{"1":1,"14.23":14.22,"1.71":3.99,"2.43":2.51,"15.6":13.2,"127":128,"2.8":3.0,"3.06":3.04,".28":0.2,"2.29":2.08,"5.64":5.1,"1.04":0.89,"3.92":3.53,"1065":760},{"1":1,"14.23":13.56,"1.71":1.71,"2.43":2.31,"15.6":16.2,"127":117,"2.8":3.15,"3.06":3.29,".28":0.34,"2.29":2.34,"5.64":6.13,"1.04":0.95,"3.92":3.38,"1065":795},{"1":1,"14.23":13.41,"1.71":3.84,"2.43":2.12,"15.6":18.8,"127":90,"2.8":2.45,"3.06":2.68,".28":0.27,"2.29":1.48,"5.64":4.28,"1.04":0.91,"3.92":3.0,"1065":1035},{"1":1,"14.23":13.88,"1.71":1.89,"2.43":2.59,"15.6":15.0,"127":101,"2.8":3.25,"3.06":3.56,".28":0.17,"2.29":1.7,"5.64":5.43,"1.04":0.88,"3.92":3.56,"1065":1095},{"1":1,"14.23":13.24,"1.71":3.98,"2.43":2.29,"15.6":17.5,"127":103,"2.8":2.64,"3.06":2.63,".28":0.32,"2.29":1.66,"5.64":4.36,"1.04":0.82,"3.92":3.0,"1065":680},{"1":1,"14.23":13.05,"1.71":1.77,"2.43":2.1,"15.6":17.0,"127":107,"2.8":3.0,"3.06":3.0,".28":0.28,"2.29":2.03,"5.64":5.04,"1.04":0.88,"3.92":3.35,"1065":885},{"1":1,"14.23":14.21,"1.71":4.04,"2.43":2.44,"15.6":18.9,"127":111,"2.8":2.85,"3.06":2.65,".28":0.3,"2.29":1.25,"5.64":5.24,"1.04":0.87,"3.92":3.33,"1065":1080},{"1":1,"14.23":14.38,"1.71":3.59,"2.43":2.28,"15.6":16.0,"127":102,"2.8":3.25,"3.06":3.17,".28":0.27,"2.29":2.19,"5.64":4.9,"1.04":1.04,"3.92":3.44,"1065":1065},{"1":1,"14.23":13.9,"1.71":1.68,"2.43":2.12,"15.6":16.0,"127":101,"2.8":3.1,"3.06":3.39,".28":0.21,"2.29":2.14,"5.64":6.1,"1.04":0.91,"3.92":3.33,"1065":985},{"1":1,"14.23":14.1,"1.71":2.02,"2.43":2.4,"15.6":18.8,"127":103,"2.8":2.75,"3.06":2.92,".28":0.32,"2.29":2.38,"5.64":6.2,"1.04":1.07,"3.92":2.75,"1065":1060},{"1":1,"14.23":13.94,"1.71":1.73,"2.43":2.27,"15.6":17.4,"127":108,"2.8":2.88,"3.06":3.54,".28":0.32,"2.29":2.08,"5.64":8.9,"1.04":1.12,"3.92":3.1,"1065":1260},{"1":1,"14.23":13.05,"1.71":1.73,"2.43":2.04,"15.6":12.4,"127":92,"2.8":2.72,"3.06":3.27,".28":0.17,"2.29":2.91,"5.64":7.2,"1.04":1.12,"3.92":2.91,"1065":1150},{"1":1,"14.23":13.83,"1.71":1.65,"2.43":2.6,"15.6":17.2,"127":94,"2.8":2.45,"3.06":2.99,".28":0.22,"2.29":2.29,"5.64":5.6,"1.04":1.24,"3.92":3.37,"1065":1265},{"1":1,"14.23":13.82,"1.71":1.75,"2.43":2.42,"15.6":14.0,"127":111,"2.8":3.88,"3.06":3.74,".28":0.32,"2.29":1.87,"5.64":7.05,"1.04":1.01,"3.92":3.26,"1065":1190},{"1":1,"14.23":13.77,"1.71":1.9,"2.43":2.68,"15.6":17.1,"127":115,"2.8":3.0,"3.06":2.79,".28":0.39,"2.29":1.68,"5.64":6.3,"1.04":1.13,"3.92":2.93,"1065":1375},{"1":1,"14.23":13.74,"1.71":1.67,"2.43":2.25,"15.6":16.4,"127":118,"2.8":2.6,"3.06":2.9,".28":0.21,"2.29":1.62,"5.64":5.85,"1.04":0.92,"3.92":3.2,"1065":1060},{"1":1,"14.23":13.56,"1.71":1.73,"2.43":2.46,"15.6":20.5,"127":116,"2.8":2.96,"3.06":2.78,".28":0.2,"2.29":2.45,"5.64":6.25,"1.04":0.98,"3.92":3.03,"1065":1120},{"1":1,"14.23":14.22,"1.71":1.7,"2.43":2.3,"15.6":16.3,"127":118,"2.8":3.2,"3.06":3.0,".28":0.26,"2.29":2.03,"5.64":6.38,"1.04":0.94,"3.92":3.31,"1065":970},{"1":1,"14.23":13.29,"1.71":1.97,"2.43":2.68,"15.6":16.8,"127":102,"2.8":3.0,"3.06":3.23,".28":0.31,"2.29":1.66,"5.64":6.0,"1.04":1.07,"3.92":2.84,"1065":1270},{"1":1,"14.23":13.72,"1.71":1.43,"2.43":2.5,"15.6":16.7,"127":108,"2.8":3.4,"3.06":3.67,".28":0.19,"2.29":2.04,"5.64":6.8,"1.04":0.89,"3.92":2.87,"1065":1285},{"1":2,"14.23":12.37,"1.71":0.94,"2.43":1.36,"15.6":10.6,"127":88,"2.8":1.98,"3.06":0.57,".28":0.28,"2.29":0.42,"5.64":1.95,"1.04":1.05,"3.92":1.82,"1065":520},{"1":2,"14.23":12.33,"1.71":1.1,"2.43":2.28,"15.6":16.0,"127":101,"2.8":2.05,"3.06":1.09,".28":0.63,"2.29":0.41,"5.64":3.27,"1.04":1.25,"3.92":1.67,"1065":680},{"1":2,"14.23":12.64,"1.71":1.36,"2.43":2.02,"15.6":16.8,"127":100,"2.8":2.02,"3.06":1.41,".28":0.53,"2.29":0.62,"5.64":5.75,"1.04":0.98,"3.92":1.59,"1065":450},{"1":2,"14.23":13.67,"1.71":1.25,"2.43":1.92,"15.6":18.0,"127":94,"2.8":2.1,"3.06":1.79,".28":0.32,"2.29":0.73,"5.64":3.8,"1.04":1.23,"3.92":2.46,"1065":630},{"1":2,"14.23":12.37,"1.71":1.13,"2.43":2.16,"15.6":19.0,"127":87,"2.8":3.5,"3.06":3.1,".28":0.19,"2.29":1.87,"5.64":4.45,"1.04":1.22,"3.92":2.87,"1065":420},{"1":2,"14.23":12.17,"1.71":1.45,"2.43":2.53,"15.6":19.0,"127":104,"2.8":1.89,"3.06":1.75,".28":0.45,"2.29":1.03,"5.64":2.95,"1.04":1.45,"3.92":2.23,"1065":355},{"1":2,"14.23":12.37,"1.71":1.21,"2.43":2.56,"15.6":18.1,"127":98,"2.8":2.42,"3.06":2.65,".28":0.37,"2.29":2.08,"5.64":4.6,"1.04":1.19,"3.92":2.3,"1065":678},{"1":2,"14.23":13.11,"1.71":1.01,"2.43":1.7,"15.6":15.0,"127":78,"2.8":2.98,"3.06":3.18,".28":0.26,"2.29":2.28,"5.64":5.3,"1.04":1.12,"3.92":3.18,"1065":502},{"1":2,"14.23":12.37,"1.71":1.17,"2.43":1.92,"15.6":19.6,"127":78,"2.8":2.11,"3.06":2.0,".28":0.27,"2.29":1.04,"5.64":4.68,"1.04":1.12,"3.92":3.48,"1065":510},{"1":2,"14.23":13.34,"1.71":0.94,"2.43":2.36,"15.6":17.0,"127":110,"2.8":2.53,"3.06":1.3,".28":0.55,"2.29":0.42,"5.64":3.17,"1.04":1.02,"3.92":1.93,"1065":750},{"1":2,"14.23":12.21,"1.71":1.19,"2.43":1.75,"15.6":16.8,"127":151,"2.8":1.85,"3.06":1.28,".28":0.14,"2.29":2.5,"5.64":2.85,"1.04":1.28,"3.92":3.07,"1065":718},{"1":2,"14.23":12.29,"1.71":1.61,"2.43":2.21,"15.6":20.4,"127":103,"2.8":1.1,"3.06":1.02,".28":0.37,"2.29":1.46,"5.64":3.05,"1.04":0.906,"3.92":1.82,"1065":870},{"1":2,"14.23":13.86,"1.71":1.51,"2.43":2.67,"15.6":25.0,"127":86,"2.8":2.95,"3.06":2.86,".28":0.21,"2.29":1.87,"5.64":3.38,"1.04":1.36,"3.92":3.16,"1065":410},{"1":2,"14.23":13.49,"1.71":1.66,"2.43":2.24,"15.6":24.0,"127":87,"2.8":1.88,"3.06":1.84,".28":0.27,"2.29":1.03,"5.64":3.74,"1.04":0.98,"3.92":2.78,"1065":472},{"1":2,"14.23":12.99,"1.71":1.67,"2.43":2.6,"15.6":30.0,"127":139,"2.8":3.3,"3.06":2.89,".28":0.21,"2.29":1.96,"5.64":3.35,"1.04":1.31,"3.92":3.5,"1065":985},{"1":2,"14.23":11.96,"1.71":1.09,"2.43":2.3,"15.6":21.0,"127":101,"2.8":3.38,"3.06":2.14,".28":0.13,"2.29":1.65,"5.64":3.21,"1.04":0.99,"3.92":3.13,"1065":886},{"1":2,"14.23":11.66,"1.71":1.88,"2.43":1.92,"15.6":16.0,"127":97,"2.8":1.61,"3.06":1.57,".28":0.34,"2.29":1.15,"5.64":3.8,"1.04":1.23,"3.92":2.14,"1065":428},{"1":2,"14.23":13.03,"1.71":0.9,"2.43":1.71,"15.6":16.0,"127":86,"2.8":1.95,"3.06":2.03,".28":0.24,"2.29":1.46,"5.64":4.6,"1.04":1.19,"3.92":2.48,"1065":392},{"1":2,"14.23":11.84,"1.71":2.89,"2.43":2.23,"15.6":18.0,"127":112,"2.8":1.72,"3.06":1.32,".28":0.43,"2.29":0.95,"5.64":2.65,"1.04":0.96,"3.92":2.52,"1065":500},{"1":2,"14.23":12.33,"1.71":0.99,"2.43":1.95,"15.6":14.8,"127":136,"2.8":1.9,"3.06":1.85,".28":0.35,"2.29":2.76,"5.64":3.4,"1.04":1.06,"3.92":2.31,"1065":750},{"1":2,"14.23":12.7,"1.71":3.87,"2.43":2.4,"15.6":23.0,"127":101,"2.8":2.83,"3.06":2.55,".28":0.43,"2.29":1.95,"5.64":2.57,"1.04":1.19,"3.92":3.13,"1065":463},{"1":2,"14.23":12.0,"1.71":0.92,"2.43":2.0,"15.6":19.0,"127":86,"2.8":2.42,"3.06":2.26,".28":0.3,"2.29":1.43,"5.64":2.5,"1.04":1.38,"3.92":3.12,"1065":278},{"1":2,"14.23":12.72,"1.71":1.81,"2.43":2.2,"15.6":18.8,"127":86,"2.8":2.2,"3.06":2.53,".28":0.26,"2.29":1.77,"5.64":3.9,"1.04":1.16,"3.92":3.14,"1065":714},{"1":2,"14.23":12.08,"1.71":1.13,"2.43":2.51,"15.6":24.0,"127":78,"2.8":2.0,"3.06":1.58,".28":0.4,"2.29":1.4,"5.64":2.2,"1.04":1.31,"3.92":2.72,"1065":630},{"1":2,"14.23":13.05,"1.71":3.86,"2.43":2.32,"15.6":22.5,"127":85,"2.8":1.65,"3.06":1.59,".28":0.61,"2.29":1.62,"5.64":4.8,"1.04":0.84,"3.92":2.01,"1065":515},{"1":2,"14.23":11.84,"1.71":0.89,"2.43":2.58,"15.6":18.0,"127":94,"2.8":2.2,"3.06":2.21,".28":0.22,"2.29":2.35,"5.64":3.05,"1.04":0.79,"3.92":3.08,"1065":520},{"1":2,"14.23":12.67,"1.71":0.98,"2.43":2.24,"15.6":18.0,"127":99,"2.8":2.2,"3.06":1.94,".28":0.3,"2.29":1.46,"5.64":2.62,"1.04":1.23,"3.92":3.16,"1065":450},{"1":2,"14.23":12.16,"1.71":1.61,"2.43":2.31,"15.6":22.8,"127":90,"2.8":1.78,"3.06":1.69,".28":0.43,"2.29":1.56,"5.64":2.45,"1.04":1.33,"3.92":2.26,"1065":495},{"1":2,"14.23":11.65,"1.71":1.67,"2.43":2.62,"15.6":26.0,"127":88,"2.8":1.92,"3.06":1.61,".28":0.4,"2.29":1.34,"5.64":2.6,"1.04":1.36,"3.92":3.21,"1065":562},{"1":2,"14.23":11.64,"1.71":2.06,"2.43":2.46,"15.6":21.6,"127":84,"2.8":1.95,"3.06":1.69,".28":0.48,"2.29":1.35,"5.64":2.8,"1.04":1.0,"3.92":2.75,"1065":680},{"1":2,"14.23":12.08,"1.71":1.33,"2.43":2.3,"15.6":23.6,"127":70,"2.8":2.2,"3.06":1.59,".28":0.42,"2.29":1.38,"5.64":1.74,"1.04":1.07,"3.92":3.21,"1065":625},{"1":2,"14.23":12.08,"1.71":1.83,"2.43":2.32,"15.6":18.5,"127":81,"2.8":1.6,"3.06":1.5,".28":0.52,"2.29":1.64,"5.64":2.4,"1.04":1.08,"3.92":2.27,"1065":480},{"1":2,"14.23":12.0,"1.71":1.51,"2.43":2.42,"15.6":22.0,"127":86,"2.8":1.45,"3.06":1.25,".28":0.5,"2.29":1.63,"5.64":3.6,"1.04":1.05,"3.92":2.65,"1065":450},{"1":2,"14.23":12.69,"1.71":1.53,"2.43":2.26,"15.6":20.7,"127":80,"2.8":1.38,"3.06":1.46,".28":0.58,"2.29":1.62,"5.64":3.05,"1.04":0.96,"3.92":2.06,"1065":495},{"1":2,"14.23":12.29,"1.71":2.83,"2.43":2.22,"15.6":18.0,"127":88,"2.8":2.45,"3.06":2.25,".28":0.25,"2.29":1.99,"5.64":2.15,"1.04":1.15,"3.92":3.3,"1065":290},{"1":2,"14.23":11.62,"1.71":1.99,"2.43":2.28,"15.6":18.0,"127":98,"2.8":3.02,"3.06":2.26,".28":0.17,"2.29":1.35,"5.64":3.25,"1.04":1.16,"3.92":2.96,"1065":345},{"1":2,"14.23":12.47,"1.71":1.52,"2.43":2.2,"15.6":19.0,"127":162,"2.8":2.5,"3.06":2.27,".28":0.32,"2.29":3.28,"5.64":2.6,"1.04":1.16,"3.92":2.63,"1065":937},{"1":2,"14.23":11.81,"1.71":2.12,"2.43":2.74,"15.6":21.5,"127":134,"2.8":1.6,"3.06":0.99,".28":0.14,"2.29":1.56,"5.64":2.5,"1.04":0.95,"3.92":2.26,"1065":625},{"1":2,"14.23":12.29,"1.71":1.41,"2.43":1.98,"15.6":16.0,"127":85,"2.8":2.55,"3.06":2.5,".28":0.29,"2.29":1.77,"5.64":2.9,"1.04":1.23,"3.92":2.74,"1065":428},{"1":2,"14.23":12.37,"1.71":1.07,"2.43":2.1,"15.6":18.5,"127":88,"2.8":3.52,"3.06":3.75,".28":0.24,"2.29":1.95,"5.64":4.5,"1.04":1.04,"3.92":2.77,"1065":660},{"1":2,"14.23":12.29,"1.71":3.17,"2.43":2.21,"15.6":18.0,"127":88,"2.8":2.85,"3.06":2.99,".28":0.45,"2.29":2.81,"5.64":2.3,"1.04":1.42,"3.92":2.83,"1065":406},{"1":2,"14.23":12.08,"1.71":2.08,"2.43":1.7,"15.6":17.5,"127":97,"2.8":2.23,"3.06":2.17,".28":0.26,"2.29":1.4,"5.64":3.3,"1.04":1.27,"3.92":2.96,"1065":710},{"1":2,"14.23":12.6,"1.71":1.34,"2.43":1.9,"15.6":18.5,"127":88,"2.8":1.45,"3.06":1.36,".28":0.29,"2.29":1.35,"5.64":2.45,"1.04":1.04,"3.92":2.77,"1065":562},{"1":2,"14.23":12.34,"1.71":2.45,"2.43":2.46,"15.6":21.0,"127":98,"2.8":2.56,"3.06":2.11,".28":0.34,"2.29":1.31,"5.64":2.8,"1.04":0.8,"3.92":3.38,"1065":438},{"1":2,"14.23":11.82,"1.71":1.72,"2.43":1.88,"15.6":19.5,"127":86,"2.8":2.5,"3.06":1.64,".28":0.37,"2.29":1.42,"5.64":2.06,"1.04":0.94,"3.92":2.44,"1065":415},{"1":2,"14.23":12.51,"1.71":1.73,"2.43":1.98,"15.6":20.5,"127":85,"2.8":2.2,"3.06":1.92,".28":0.32,"2.29":1.48,"5.64":2.94,"1.04":1.04,"3.92":3.57,"1065":672},{"1":2,"14.23":12.42,"1.71":2.55,"2.43":2.27,"15.6":22.0,"127":90,"2.8":1.68,"3.06":1.84,".28":0.66,"2.29":1.42,"5.64":2.7,"1.04":0.86,"3.92":3.3,"1065":315},{"1":2,"14.23":12.25,"1.71":1.73,"2.43":2.12,"15.6":19.0,"127":80,"2.8":1.65,"3.06":2.03,".28":0.37,"2.29":1.63,"5.64":3.4,"1.04":1.0,"3.92":3.17,"1065":510},{"1":2,"14.23":12.72,"1.71":1.75,"2.43":2.28,"15.6":22.5,"127":84,"2.8":1.38,"3.06":1.76,".28":0.48,"2.29":1.63,"5.64":3.3,"1.04":0.88,"3.92":2.42,"1065":488},{"1":2,"14.23":12.22,"1.71":1.29,"2.43":1.94,"15.6":19.0,"127":92,"2.8":2.36,"3.06":2.04,".28":0.39,"2.29":2.08,"5.64":2.7,"1.04":0.86,"3.92":3.02,"1065":312},{"1":2,"14.23":11.61,"1.71":1.35,"2.43":2.7,"15.6":20.0,"127":94,"2.8":2.74,"3.06":2.92,".28":0.29,"2.29":2.49,"5.64":2.65,"1.04":0.96,"3.92":3.26,"1065":680},{"1":2,"14.23":11.46,"1.71":3.74,"2.43":1.82,"15.6":19.5,"127":107,"2.8":3.18,"3.06":2.58,".28":0.24,"2.29":3.58,"5.64":2.9,"1.04":0.75,"3.92":2.81,"1065":562},{"1":2,"14.23":12.52,"1.71":2.43,"2.43":2.17,"15.6":21.0,"127":88,"2.8":2.55,"3.06":2.27,".28":0.26,"2.29":1.22,"5.64":2.0,"1.04":0.9,"3.92":2.78,"1065":325},{"1":2,"14.23":11.76,"1.71":2.68,"2.43":2.92,"15.6":20.0,"127":103,"2.8":1.75,"3.06":2.03,".28":0.6,"2.29":1.05,"5.64":3.8,"1.04":1.23,"3.92":2.5,"1065":607},{"1":2,"14.23":11.41,"1.71":0.74,"2.43":2.5,"15.6":21.0,"127":88,"2.8":2.48,"3.06":2.01,".28":0.42,"2.29":1.44,"5.64":3.08,"1.04":1.1,"3.92":2.31,"1065":434},{"1":2,"14.23":12.08,"1.71":1.39,"2.43":2.5,"15.6":22.5,"127":84,"2.8":2.56,"3.06":2.29,".28":0.43,"2.29":1.04,"5.64":2.9,"1.04":0.93,"3.92":3.19,"1065":385},{"1":2,"14.23":11.03,"1.71":1.51,"2.43":2.2,"15.6":21.5,"127":85,"2.8":2.46,"3.06":2.17,".28":0.52,"2.29":2.01,"5.64":1.9,"1.04":1.71,"3.92":2.87,"1065":407},{"1":2,"14.23":11.82,"1.71":1.47,"2.43":1.99,"15.6":20.8,"127":86,"2.8":1.98,"3.06":1.6,".28":0.3,"2.29":1.53,"5.64":1.95,"1.04":0.95,"3.92":3.33,"1065":495},{"1":2,"14.23":12.42,"1.71":1.61,"2.43":2.19,"15.6":22.5,"127":108,"2.8":2.0,"3.06":2.09,".28":0.34,"2.29":1.61,"5.64":2.06,"1.04":1.06,"3.92":2.96,"1065":345},{"1":2,"14.23":12.77,"1.71":3.43,"2.43":1.98,"15.6":16.0,"127":80,"2.8":1.63,"3.06":1.25,".28":0.43,"2.29":0.83,"5.64":3.4,"1.04":0.7,"3.92":2.12,"1065":372},{"1":2,"14.23":12.0,"1.71":3.43,"2.43":2.0,"15.6":19.0,"127":87,"2.8":2.0,"3.06":1.64,".28":0.37,"2.29":1.87,"5.64":1.28,"1.04":0.93,"3.92":3.05,"1065":564},{"1":2,"14.23":11.45,"1.71":2.4,"2.43":2.42,"15.6":20.0,"127":96,"2.8":2.9,"3.06":2.79,".28":0.32,"2.29":1.83,"5.64":3.25,"1.04":0.8,"3.92":3.39,"1065":625},{"1":2,"14.23":11.56,"1.71":2.05,"2.43":3.23,"15.6":28.5,"127":119,"2.8":3.18,"3.06":5.08,".28":0.47,"2.29":1.87,"5.64":6.0,"1.04":0.93,"3.92":3.69,"1065":465},{"1":2,"14.23":12.42,"1.71":4.43,"2.43":2.73,"15.6":26.5,"127":102,"2.8":2.2,"3.06":2.13,".28":0.43,"2.29":1.71,"5.64":2.08,"1.04":0.92,"3.92":3.12,"1065":365},{"1":2,"14.23":13.05,"1.71":5.8,"2.43":2.13,"15.6":21.5,"127":86,"2.8":2.62,"3.06":2.65,".28":0.3,"2.29":2.01,"5.64":2.6,"1.04":0.73,"3.92":3.1,"1065":380},{"1":2,"14.23":11.87,"1.71":4.31,"2.43":2.39,"15.6":21.0,"127":82,"2.8":2.86,"3.06":3.03,".28":0.21,"2.29":2.91,"5.64":2.8,"1.04":0.75,"3.92":3.64,"1065":380},{"1":2,"14.23":12.07,"1.71":2.16,"2.43":2.17,"15.6":21.0,"127":85,"2.8":2.6,"3.06":2.65,".28":0.37,"2.29":1.35,"5.64":2.76,"1.04":0.86,"3.92":3.28,"1065":378},{"1":2,"14.23":12.43,"1.71":1.53,"2.43":2.29,"15.6":21.5,"127":86,"2.8":2.74,"3.06":3.15,".28":0.39,"2.29":1.77,"5.64":

In [31]:
df1.to_json(orient='records')

'[{"employee_name":"james","email":"james@gmail.com","job_profile":{"title1":"team lead","title2":"devoloper"}}]'

In [12]:
##read and write operation on csv and tsv files 
df=pd.read_csv('ex1.csv') ##(csv-comma seperated files )

In [13]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
df['a']

0    1
1    5
2    9
Name: a, dtype: int64

In [8]:
type(df['a'])

pandas.core.series.Series

In [10]:
df.head() ##this gives top 5 records

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
df.head(2)

   a  b  c  d message
0  1  2  3  4   hello
1  5  6  7  8   world

In [12]:
df.tail() ##to load bottom data from table

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
df.tail(2)

   a   b   c   d message
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
###read table (for this we use tsv file that is tab(\t) seperated value )
pd.read_table('test.tsv')

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [19]:
pd.read_csv('test.tsv',sep="\t") ##we can also use read_csv with seperator

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [21]:
pd.read_table('ex1.csv',sep=',',header='infer') ##first row and columns is considered as index

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [22]:
##header can take two values infer and none 
pd.read_table('ex1.csv',sep=',',header=None)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [23]:
##GIVING NAMES TO HEADER 
pd.read_table('ex1.csv',sep=',',header=None,names=['a','b','c','d','e'])

   a   b   c   d        e
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [24]:
pd.read_table('ex1.csv',sep=',',header=None,names=['a','b','c','d']) ##indexes is shifted ny one column

    a   b   c        d
a   b   c   d  message
1   2   3   4    hello
5   6   7   8    world
9  10  11  12      foo

In [27]:
pd.read_table('ex1.csv',sep=',',header=None,names=['a','b','c','d','e'],usecols=['a','e'])

   a        e
0  a  message
1  1    hello
2  5    world
3  9      foo

In [28]:
parsed=pd.read_csv('csv_mindex.csv',index_col=['key1','key2'])
parsed[]

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [75]:
parsed.index

MultiIndex([('one', 'a'),
            ('one', 'b'),
            ('one', 'c'),
            ('one', 'd'),
            ('two', 'a'),
            ('two', 'b'),
            ('two', 'c'),
            ('two', 'd')],
           names=['key1', 'key2'])

In [ ]:
##chunk size- of data to be stored

In [30]:
pd.read_csv('ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [36]:
pd.read_csv('ex4.csv',skiprows=[0,2,3]) ##skipping unwanted  rows

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [42]:
pd.read_csv('ex5.csv') ##NAN is empty value

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [72]:
##to check whether we have NaN values in data 
import pandas as pd 
df=pd.read_csv('ex5.csv')
pd.isnull(df)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [74]:
df.isnull().sum

<bound method DataFrame.sum of    something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False>

In [80]:
 ##CHANGE NAN TO NULL
df.fillna('null')

  something  a   b     c   d message
0       one  1   2     3   4    null
1       two  5   6  null   8   world
2     three  9  10    11  12     foo

In [52]:
##reading excel (specify sheet name ) 
pd.read_excel('ex1.xlsx',sheet_name='Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [56]:
!pip install lxml

Requirement already satisfied: lxml in c:\programdata\anaconda3\lib\site-packages (4.6.1)

In [64]:
## reading html files  ##type will be list 
table_info=pd.read_html('fdic_failed_bank_list.html') ##can be done using website that has table data

In [65]:
table_info

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [66]:
table_info[0] ##whole table is considered as one data frame with zero

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [5]:
url='https://www.fdic.gov/bank/individual/failed/banklist.html'
dfs=pd.read_html(url)

In [10]:
dfs[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [8]:
type(dfs)

list

In [11]:
url_mcc='https://en.wikipedia.org/wiki/Mobile_country_code'
dfs=pd.read_html(url_mcc,match='country',header=0) ##match is used to select the particular table in a website that has many tables

In [13]:
dfs[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

##pickling
all pandas objects are equipped with to_pickle methids which use pythons cpickle module to save data structures to disk using the pickle format.

In [14]:
df_excel.to_pickle('df_excel')

NameError: name 'df_excel' is not defined

In [16]:
df_excel=pd.read_excel('ex1.xlsx')

In [17]:
df_excel.head()

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [18]:
df_excel.to_pickle('df_excel')

In [19]:
df=pd.read_pickle('df_excel')

In [21]:
df.head()

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [22]:
type(df)

pandas.core.frame.DataFrame